In [2]:
import pandas as pd
from sklearn import linear_model

In [3]:
df = pd.read_csv('LinearRegression_MultiVar2Data.csv')

In [4]:
df

,experience,test_score(out of 10),interview_score(out of 10),salary($),Unnamed: 4
0,NaN,8.0,9,50000,NaN
1,NaN,8.0,6,45000,NaN
2,five,6.0,7,60000,NaN
3,two,10.0,10,65000,NaN
4,seven,9.0,6,70000,NaN
5,three,7.0,10,62000,NaN
6,ten,NaN,7,72000,NaN
7,eleven,7.0,8,80000,NaN

In [5]:
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)', 'Unnamed: 4'],
      dtype='object')

In [6]:
df.drop('Unnamed: 4', axis = 1, inplace = True)

In [7]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [16]:
df.columns = ['experience', 'test_score', 'interview_score', 'salary']

In [17]:
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [18]:
df.interview_score

0     9
1     6
2     7
3    10
4     6
5    10
6     7
7     8
Name: interview_score, dtype: int64

In [19]:
df.test_score = df.test_score.fillna(df.test_score.median())
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [20]:
df.experience = df.experience.fillna(0)

In [21]:
df

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [24]:
pip install word2number

Collecting word2numberNote: you may need to restart the kernel to use updated packages.
  Downloading word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5583 sha256=8bbdf223a1e20f44b349aae72b26103fdd68fee595e464250a079871b8156f2c
  Stored in directory: c:\users\dell\appdata\local\pip\cache\wheels\a0\4a\5b\d2f2df5c344ddbecb8bea759872c207ea91d93f57fb54e816e
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1

In [25]:
from word2number import w2n

In [31]:
w2n.word_to_num('seven')

7

In [32]:
display(df.dtypes)

experience          object
test_score         float64
interview_score      int64
salary               int64
dtype: object

In [45]:
for i in df.experience:
    if i == 0:
        df.experience = df.experience.replace([i], "Zero")

In [46]:
df

  experience  test_score  interview_score  salary
0       Zero         8.0                9   50000
1       Zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [47]:
for i in df.experience:
    df.experience = df['experience'].replace([i], w2n.word_to_num(i))

In [48]:
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

In [49]:
reg = linear_model.LinearRegression()

In [50]:
reg.fit(df[['experience', 'test_score', 'interview_score']], df.salary)

LinearRegression()

In [54]:
reg.predict([[7,9.0,6]])

C:\Users\DELL\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([67270.74235808])

In [56]:
reg.predict([[2,9,6]])

C:\Users\DELL\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671])

In [57]:
reg.predict([[12,10,10]])

C:\Users\DELL\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([92002.18340611])